10/data/attachments/e3f1b2369c1a626e.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:sendInvitationRequest>
            <nif:username>Brian_send_Friend_40309_2</nif:username>
            <nif:friendToBeRequested>soap_friends_cd72e90a-4f6b-4d2f-8072-71fdbca03d0f</nif:friendToBeRequested>
        </nif:sendInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>